#pragma once

#include <string>
#include "DInput.h"

const int CURRENT_VERSION = 1068; // current version

const float PACKET_INTERVAL_MOVE = 1.5f;				// Periodic packet time interval
const float PACKET_INTERVAL_ROTATE = 4.0f;
const float PACKET_INTERVAL_REQUEST_TARGET_HP = 2.0f;

// Part of the keyboard shortcut
enum eKeyMap {	KM_HOTKEY1 = DIK_1, 
				KM_HOTKEY2 = DIK_2, 
				KM_HOTKEY3 = DIK_3, 
				KM_HOTKEY4 = DIK_4, 
				KM_HOTKEY5 = DIK_5, 
				KM_HOTKEY6 = DIK_6, 
				KM_HOTKEY7 = DIK_7, 
				KM_HOTKEY8 = DIK_8, 
				KM_TOGGLE_RUN = DIK_T, 
				KM_TOGGLE_MOVE_CONTINOUS = DIK_E, 
				KM_TOGGLE_ATTACK = DIK_R, 
				KM_TOGGLE_SITDOWN = DIK_C, 
				KM_TOGGLE_INVENTORY = DIK_I, 
				KM_TOGGLE_SKILL = DIK_K, 
				KM_TOGGLE_STATE = DIK_U, 
				KM_TOGGLE_MINIMAP = DIK_M, 
				KM_TOGGLE_HELP = DIK_F1, 
				KM_CAMERA_CHANGE = DIK_F9, 
				KM_DROPPED_ITEM_OPEN = DIK_F, 
				KM_MOVE_FOWARD = DIK_W, 
				KM_MOVE_BACKWARD = DIK_S, 
				KM_ROTATE_LEFT = DIK_A, 
				KM_ROTATE_RIGHT = DIK_D, 
				KM_TARGET_NEARST_ENEMY = DIK_Z, 
				KM_TARGET_NEARST_PARTY = DIK_X, 
				KM_TARGET_NEARST_FRIEND = DIK_V, 
				KM_TARGET_PARTY1 = DIK_F1, 
				KM_TARGET_PARTY2 = DIK_F2, 
				KM_TARGET_PARTY3 = DIK_F3, 
				KM_TARGET_PARTY4 = DIK_F4, 
				KM_TARGET_PARTY5 = DIK_F5, 
				KM_TARGET_PARTY6 = DIK_F6, 
				KM_TARGET_PARTY7 = DIK_F7, 
				KM_TARGET_PARTY8 = DIK_F8 };

enum e_PlayerType { PLAYER_BASE = 0, PLAYER_NPC = 1, PLAYER_OTHER = 2, PLAYER_MYSELF = 3 };

enum e_Race {	RACE_ALL = 0,

						PSA_COUNT};

enum e_StateDying {		PSD_DISJOINT = 0,	// Disintegrate-Disassemble-Decompose and die
						PSD_KNOCK_DOWN,		// Die by being blown away or pushed back
						PSD_KEEP_POSITION,	// Die on the spot
						PSD_COUNT,

						PSD_UNKNOWN = 0xffffffff };

enum e_StateParty {	PSP_NORMAL = 0,
					PSP_POISONING = 1,
					PSP_CURSED = 2,
					PSP_MAGIC_TAKEN = 4,
					PSP_BLESSED = 8,
					PSP_UNKNOWN = 0xffffffff };

enum e_PartPosition	{	PART_POS_UPPER = 0,
						PART_POS_LOWER,
						PART_POS_FACE,
						PART_POS_HANDS,
						PART_POS_FEET, 
						PART_POS_HAIR_HELMET,
						PART_POS_COUNT,
						PART_POS_UNKNOWN = 0xffffffff };

enum e_PlugPosition {	PLUG_POS_RIGHTHAND = 0,
						PLUG_POS_LEFTHAND, 
						PLUG_POS_BACK, 
						PLUG_POS_KNIGHTS_GRADE, 
						PLUG_POS_COUNT,
						PLUG_POS_UNKNOWN = 0xffffffff };

enum e_ItemAttrib	{
						ITEM_ATTRIB_GENERAL = 0,
						ITEM_ATTRIB_MAGIC	= 1,
						ITEM_ATTRIB_LAIR	= 2,
						ITEM_ATTRIB_CRAFT	= 3,
						ITEM_ATTRIB_UNIQUE	= 4,
						ITEM_ATTRIB_UPGRADE	= 5,		
						ITEM_ATTRIB_UNKNOWN = 0xffffffff };	

enum e_ItemClass	{	ITEM_CLASS_DAGGER = 11, // Dagger(dagger)
						ITEM_CLASS_SWORD = 21, // One-handedsword(onehandsword)
						ITEM_CLASS_SWORD_2H = 22, // 3 : Two-handedsword(twohandsword)
						ITEM_CLASS_AXE = 31, // One-handedax(onehandaxe)
						ITEM_CLASS_AXE_2H = 32, // Two-handedax(twohandaxe)
						ITEM_CLASS_MACE = 41, // One-handed mace(mace)
						ITEM_CLASS_MACE_2H = 42, // Two-handed mace(twohandmace)
						ITEM_CLASS_SPEAR = 51, // Spear(spear)
						ITEM_CLASS_POLEARM = 52, // Polearm(polearm)
						
						ITEM_CLASS_SHIELD = 60, // Shield(shield)

						ITEM_CLASS_BOW = 70, //  ShortBow(Shortbow)
						ITEM_CLASS_BOW_CROSS = 71, // Crossbow(crossbow)
						ITEM_CLASS_BOW_LONG = 80, // Longbow(longbow)

						ITEM_CLASS_EARRING = 91, // Earring
						ITEM_CLASS_AMULET = 92, // Necklace
						ITEM_CLASS_RING = 93, // Ring jewelry
						ITEM_CLASS_BELT = 94, // Waist Belt
						ITEM_CLASS_CHARM = 95, // Items you have in your inventory
						ITEM_CLASS_JEWEL = 96, // Type of jewelry
						ITEM_CLASS_POTION = 97, // Liquid medicine-Potion
						ITEM_CLASS_SCROLL = 98, // Scroll

						ITEM_CLASS_LAUNCHER = 100, // Items used when throwing spears
						
						ITEM_CLASS_STAFF = 110, // Staff-Wand(staff)
						ITEM_CLASS_ARROW = 120, // Arrow(Arrow)
						ITEM_CLASS_JAVELIN = 130, // Javelin
						
						ITEM_CLASS_ARMOR_WARRIOR = 210, // Warrior armor
						ITEM_CLASS_ARMOR_ROGUE = 220, // Rogue armor
						ITEM_CLASS_ARMOR_MAGE = 230, // Wizard armor
						ITEM_CLASS_ARMOR_PRIEST = 240, // Priest armor

						ITEM_CLASS_ETC = 251, // etc

						ITEM_CLASS_UNKNOWN = 0xffffffff }; // 

enum e_Nation { NATION_NOTSELECTED = 0, NATION_KARUS, NATION_ELMORAD, NATION_UNKNOWN = 0xffffffff };

struct __TABLE_ITEM_BASIC;
struct __TABLE_ITEM_EXT;
struct __TABLE_PLAYER;

enum e_Authority { AUTHORITY_MANAGER = 0, AUTHORITY_USER, AUTHORITY_NOCHAT, AUTHORITY_NPC, AUTHORITY_BLOCK_USER = 0xff };

struct __InfoPlayerBase
{
	int			iID;			// Unique ID
	std::string szID;			// Name
	D3DCOLOR	crID;			// Name color
	e_Race		eRace;			// Race based on character skeleton
	e_Nation	eNation;		// Nation
	e_Class		eClass;			// Job-Profession
	int			iLevel;			// Level
	int			iHPMax;	
	int			iHP; 
	int			iAuthority;		// Authority - 0 administrator, 1 - general user, 255 - blocked user

	bool		bRenderID;		// Show ID on the screen

	void Init()
	{
		iID = 0;					// Unique ID
		szID = "";					// Name
		crID = 0;					// Name color
		eRace = RACE_UNKNOWN;		// Race based on character skeleton
		eNation = NATION_UNKNOWN;	// Nation
		eClass = CLASS_UNKNOWN;		// Job-Profession
		iLevel = 0;					// Level
		iHPMax = 0;	
		iHP = 0; 
		iAuthority = 1;				// Authority - 0 administrator, 1 - general user, 255 - blocked user...
		bRenderID = true;
	}
};

struct __InfoPlayerOther
{
	int			iFace;			// Face shape
	int			iHair;			// Hair shape

	int			iCity;			// Affiliated city
	int			iKnightsID;		// Affiliated Knights (Guild) ID
	std::string szKnights;		// Affiliated Knights (Guild) Name
	int			iKnightsGrade;	// Affiliated Knights (Guild) Rank
	int			iKnightsRank;	// Affiliated Order of Knights (Guild) Ranking

	int			iRank;			// Title - count, duke - classification according to authority
	int			iTitle;			// Position - lord, lord - simple status -> guild leader

	void Init()
	{
		iFace = 0;			// Face shape
		iHair = 0;			// Hair shape
		iCity;				// Affiliated city
		iKnightsID = 0;		// Affiliated Knights (Guild) ID
		szKnights = "";		// Affiliated Knights (Guild) Name
		iKnightsGrade = 0;	// Affiliated Knights (Guild) Rank
		iKnightsRank = 0;	// Affiliated Order of Knights (Guild) Ranking
		iTitle = 0;			// Position - lord, lord - simple status -> guild leader
	}
};

// Templar position
enum e_KnightsDuty {	KNIGHTS_DUTY_UNKNOWN = 0,		// ????? kicked out??
						KNIGHTS_DUTY_CHIEF = 1,			// Chief of Staff
						KNIGHTS_DUTY_VICECHIEF = 2,		// Vice Captain
						KNIGHTS_DUTY_PUNISH = 3,		// Being disciplined
						KNIGHTS_DUTY_TRAINEE = 4,		// Knight Apprentice
						KNIGHTS_DUTY_KNIGHT = 5,		// General Knight
						KNIGHTS_DUTY_OFFICER = 6		// Officer
					};

#define VICTORY_ABSENCE		0
#define VICTORY_KARUS		1
#define VICTORY_ELMORAD		2

struct __InfoPlayerMySelf : public __InfoPlayerOther
{
	int					iBonusPointRemain;	// Remaining bonus points
	int					iLevelPrev; 		// Previous level...

	int					iMSPMax; 
	int					iMSP; 
			
	int					iTargetHPPercent;
	int					iGold;
	int					iExpNext;
	int					iExp; 
	int					iRealmPoint;		// National contribution
	e_KnightsDuty		eKnightsDuty;		// Templar Rights
	int					iWeightMax;			// Total weight of the item
	int					iWeight;			// Maximum weight you can carry-lift
	int					iStrength;			// Strength
	int					iStrength_Delta;	// A value added or subtracted by an item or magic
	int					iStamina;			// Health Points
	int					iStamina_Delta;		// A value added or subtracted by an item or magic
	int					iDexterity;			// Dex
	int					iDexterity_Delta;	// A value added or subtracted by an item or magic
	int					iIntelligence;		// INT
	int					iIntelligence_Delta; // A value added or subtracted by an item or magic
	int 				iMagicAttak;		// MP Magical Attack (charm)
	int 				iMagicAttak_Delta;	// A value added or subtracted by an item or magic
	
	int 				iAttack;		// Attack power
	int 				iAttack_Delta;	// Value added or subtracted by magic
	int 				iGuard;			// Defense
	int 				iGuard_Delta;	// Value added or subtracted by magic

	int 				iRegistFire;			// Fire Resistance
	int 				iRegistFire_Delta;		// Value added or subtracted by magic
	int 				iRegistCold;			// Ice Resistance
	int 				iRegistCold_Delta;		// Value added or subtracted by magic
	int 				iRegistLight;			// Lightning Resistance
	int 				iRegistLight_Delta;		// Value added or subtracted by magic
	int 				iRegistMagic;			// Magic Resistance
	int 				iRegistMagic_Delta;		// Value added or subtracted by magic
	int 				iRegistCurse;			// Curse Resistance
	int 				iRegistCurse_Delta;		// Value added or subtracted by magic
	int 				iRegistPoison;			// Poison Resistance
	int 				iRegistPoison_Delta;	// Value added or subtracted by magic

	int					iZoneInit;				// The first zone number received from the server
	int					iZoneCur;				// Current zone
	int					iVictoryNation;			// 0: Draw 1: Elmorad wins 2: Karus wins

	void Init()
	{
		__InfoPlayerOther::Init();

		iBonusPointRemain = 0; // Remaining bonus points
		iLevelPrev = 0; // Previous level

		iMSPMax = 0; 
		iMSP = 0; 
		
		iTargetHPPercent = 0;
		iGold = 0;
		iExpNext = 0;
		iExp = 0; 
		iRealmPoint = 0;		// National contribution
		eKnightsDuty = KNIGHTS_DUTY_UNKNOWN;		// Templar Rights
		iWeightMax = 0;			// Total weight of the item
		iWeight = 0;			// Maximum weight you can carry-lift
		iStrength = 0;			// Strength
		iStrength_Delta = 0;	// Value added or subtracted by magic
		iStamina = 0;			// Health Points
		iStamina_Delta = 0;		// Value added or subtracted by magic
		iDexterity = 0;			// Dex
		iDexterity_Delta = 0;	// Value added or subtracted by magic
		iIntelligence = 0;		// Int
		iIntelligence_Delta = 0; // Value added or subtracted by magic
		iMagicAttak = 0;		// MP Magical Attack (charm)
		iMagicAttak_Delta = 0;	// Value added or subtracted by magic
		
		iAttack = 0;		// Attack power
		iAttack_Delta = 0;	// Value added or subtracted by magic
		iGuard = 0;			// Defense power
		iGuard_Delta = 0;	// Value added or subtracted by magic

		iRegistFire = 0;			// Fire resistance
		iRegistFire_Delta = 0;		// Value added or subtracted by magic
		iRegistCold = 0;			// Ice resistance
		iRegistCold_Delta = 0;		// Value added or subtracted by magic
		iRegistLight = 0;			// Light resistance
		iRegistLight_Delta = 0;		// Value added or subtracted by magic
		iRegistMagic = 0;			// Magic resistance
		iRegistMagic_Delta = 0;		// Value added or subtracted by magic
		iRegistCurse = 0;			// Curse resistance
		iRegistCurse_Delta = 0;		// Value added or subtracted by magic
		iRegistPoison = 0;			// Poison resistance
		iRegistPoison_Delta = 0;	// Value added or subtracted by magic

		iZoneInit = 0x01;			// The first zone number received from the server
		iZoneCur = 0;				// Current Zone
		iVictoryNation = -1;		// 0: Draw 1: Elmorad wins 2: Karus wins
	}
};

const int MAX_PARTY_OR_FORCE = 8;

struct __InfoPartyOrForce
{
    int         iID;             // party member ID
    int         iLevel;          // Level
    e_Class     eClass;          // Job
    int         iHP;             // Hit Point
    int         iHPMax;          // Hit Point Max
    bool        bSufferDown_HP;  // Status - Low HP - Falling - Fall
    bool        bSufferDown_Etc; // Status - When affected by curses
    std::string szID;            // Party name string

	void Init()
	{
		iID = -1;
		iLevel = 0;
		eClass = CLASS_UNKNOWN;
		iHP = 0;
		iHPMax = 0;
		szID = "";

		bSufferDown_HP = false;			// Status - Low HP - Falling - Fall
		bSufferDown_Etc = false;		// Status - When affected by curses
	};

	__InfoPartyOrForce()
	{
		this->Init();
	}
};

enum e_PartyStatus { PARTY_STATUS_DOWN_HP = 1, PARTY_STATUS_DOWN_ETC = 2 };

struct __InfoPartyBBS // Party support bulletin board structure
{
    std::string szID;   // Party name string
    int         iID;    // Party member ID
    int         iLevel; // Level
    e_Class     eClass; // Job
    int         iMemberCount;

	void Init()
	{
		szID = "";
		iID = -1;
		iLevel = 0;
		eClass = CLASS_UNKNOWN;
		iMemberCount = 0;
	};

	__InfoPartyBBS()
	{
		this->Init();
	}
};

enum {	RESRC_UI_LOGIN = 0, RESRC_UI_CHARACTERSELECT, RESRC_UI_CHARACTERCREATE, RESRC_UI_INVENTORY, RESRC_UI_CHAT,
		RESRC_UI_MYINFORMATION, RESRC_UI_TARGET, RESRC_UI_HOTKEY, RESRC_UI_FUNCTION };

typedef struct __TABLE_ZONE
{
	DWORD			dwID; 								// zone ID
	std::string		szTerrainFN; 						// Terrain FileName - Terrain, Tile Map, ColorMap
	std::string 	szZoneName;
	std::string		szColorMapFN;
	std::string		szLightMapFN;
	std::string		szObjectPostDataFN; 				// Object location information - Collision check data is also included in this
	std::string		szObjectPostDataExtFN; 				// Todo implement
	std::string		szMiniMapFN;
	std::string 	szSkySetting; 						// A setting information file that adjusts the sky and atmosphere
	uint32_t		bIndicateEnemyPlayer;				// Do you show enemy players?
	uint32_t		iFixedSundDirection;				// Fixed direction of the sun
	std::string 	szLightObjFN;						// Light information file placed on the terrain

	std::string 	szGevFN;         					// TODO: implement
	uint32_t    	iAbyssSomething; 					// TODO: implement
	std::string 	szEnsFN;         					// TODO: implement
	float			fFOV;            					// TODO: implement
	std::string 	szFlagFN;        					// TODO: implement

	uint32_t 		iIdk1;
	uint32_t 		iIdk2;
	uint32_t 		iIdk3;
	uint32_t 		iIdk4;

	std::string		szOpdSubFN;
	uint32_t 		iIdk5;
	std::string		szEvtSubFN;
} TABLE_ZONE;

typedef struct __TABLE_UI_RESRC
{
	uint32_t	dwID;					// 0 (Karus/Human)
	std::string szLogIn;				// 1
	std::string szCmd;					// 2
	std::string szChat;					// 3
	std::string szMsgOutput;			// 4
	std::string szStateBar;				// 5
	std::string szVarious;				// 6 
	std::string szState;				// 7 
	std::string szKnights;				// 8 
	std::string szQuest;				// 9 
	std::string szFriends;				// 10 
	std::string szInventory;			// 11
	std::string szTransaction;			// 12
	std::string szDroppedItem;			// 13
	std::string szTargetBar;			// 14
	std::string szTargetSymbolShape;	// 15
	std::string szSkillTree;			// 16
	std::string szHotKey;				// 17
	std::string szMiniMap;				// 18
	std::string szPartyOrForce;			// 19
	std::string szPartyBBS;				// 20
	std::string szHelp;					// 21
	std::string szNotice;				// 22
	std::string szCharacterCreate;		// 23
	std::string szCharacterSelect;		// 24
	std::string szToolTip;				// 25
	std::string szMessageBox;			// 26
	std::string szLoading;				// 27
	std::string szItemInfo;				// 28
	std::string szPersonalTrade;		// 29
	std::string szPersonalTradeEdit;	// 30
	std::string szNpcEvent;				// 31
	std::string szZoneChangeOrWarp;		// 32
	std::string szExchangeRepair;		// 33
	std::string szRepairTooltip;		// 34
	std::string szNpcTalk;				// 35
	std::string szNpcExchangeList;		// 36
	std::string szKnightsOperation;		// 37
	std::string szClassChange;			// 38
	std::string szEndingDisplay;		// 39
	std::string szWareHouse;			// 40
	std::string szChangeClassInit;		// 41
	std::string szChangeInitBill;		// 42
	std::string szInn;					// 43
	std::string szInputClanName;		// 44
	std::string szTradeBBS;				// 45
	std::string szTradeBBSSelector;		// 46
	std::string szTradeExplanation;		// 47
	std::string szTradeMemolist;		// 48
	std::string szQuestMenu;			// 49
	std::string szQuestTalk;			// 50
	std::string szQuestEdit;			// 51
	std::string szDead;					// 52
	std::string szElLoading;			// 53
	std::string szKaLoading;			// 54
	std::string szNationSelect;			// 55
	std::string szChat2;				// 56
	std::string szMsgOutput2;			// 57
	std::string szItemUpgrade;			// 58
	std::string szDuelCreate;			// 59
	std::string szDuelList;				// 60
	std::string szDuelMsg;				// 61
	std::string szDuelMsgEdit;			// 62
	std::string szDuelLobby;			// 63
	std::string szQuestContent;			// 64
	std::string szDuelItemCnt;			// 65
	std::string szTradeInv;				// 66
	std::string szTradeBuyInv;			// 67
	std::string szTradeItemDisplay;		// 68
	std::string szTradePrice;			// 69
	std::string szTradeCnt;				// 70
	std::string szTradeMsgBox;			// 71
	std::string szClanPage;				// 72
	std::string szAllyPage;				// 73
	std::string szAlly2Page;			// 74
	std::string szCmdList;				// 75
	std::string szCmdEdit;				// 76
	std::string szClanLogo;				// 77
	std::string szShopMall;				// 78
	std::string szLvlGuide;				// 79
	std::string szCSWNpc;				// 80
	std::string szKCSWPetition;			// 81
	std::string szCSWAlly;				// 82
	std::string szCSWSchedule;			// 83
	std::string szExitMenu;				// 84
	std::string szResurrect;			// 85
	std::string szNameChange;			// 86
	std::string szNameEditBox;			// 87
	std::string szNameCheck;			// 88
	std::string szCSWAdmin;				// 89
	std::string szCSWTax;				// 90
	std::string szCSWCapeList;			// 91
	std::string szKnightCapeShop;		// 92
	std::string szCSWTaxCollection;		// 93
	std::string szCSWTaxRate;			// 94
	std::string szCSWTaxRateMsg;		// 95
	std::string szCatapult;				// 96
	std::string szDisguiseRing;			// 97
	std::string szMsgBoxOk;				// 98
	std::string szMsgBoxOkCancel;		// 99
	std::string szOpenChat;				// 100
	std::string szCloseChat;			// 101
	std::string szChrClanLogo;			// 102
	std::string szWarning;				// 103
	std::string szConvo;				// 104
	std::string szBlog;					// 105
	std::string szInnPass;				// 106
	std::string szNoviceTips;			// 107
	std::string szWebpage;				// 108
	std::string szPartyMsgBox;			// 109
	std::string szClanLogo2;			// 110
	std::string szRentalNpc;			// 111
	std::string szRentalTransaction;	// 112
	std::string szRentalEntry;			// 113
	std::string szRentalItem;			// 114
	std::string szRentalMsg;			// 115
	std::string szRentalCnt;			// 116
	std::string szNetDIO;				// 117
	std::string szLoginIntro;			// 118
	std::string szSubLoginIntro;		// 119
	std::string szCharSelect;			// 120
	std::string szCharCreate;			// 121
	std::string szOtherState;			// 122
	std::string szPPCardBegin;			// 123
	std::string szPPCardList;			// 124
	std::string szPPCardReg;			// 125
	std::string szPPCardMsg;			// 126
	std::string szPPCardBuyList;		// 127
	std::string szPPCardMyInfo;			// 128
	std::string szNationSelect2;		// 129
	std::string szUSALogo;				// 130
	std::string szMonster;				// 131
	std::string szNationTaxNPC;			// 132
	std::string szNationTaxRate;		// 133
	std::string szKingMsgBoxOk;			// 134
	std::string szKingMsgBoxOkCancel;	// 135
	std::string szKingElectionBoard;	// 136
	std::string szKingElectionList;		// 137
	std::string szKingElectionMain;		// 138
	std::string szKingNominate;			// 139
	std::string szKingRegister;			// 140
	std::string szUpgradeRing;			// 141
	std::string szUpgradeSelect;		// 142
	std::string szTradeMsg;				// 143
	std::string szShowIcon;				// 144

} TABLE_UI_RESRC;

typedef struct __TABLE_ITEM_BASIC // Resource records for equipped items
{
	DWORD		dwID;				// 00 Item number code
	BYTE 		byExtIndex;			// 01 Extended index
	std::string	szName;				// 02 Name
	std::string	szRemark;			// 03 Item description	
	DWORD       dwTODO1;    		// 04 TODO: implement introduced in 1264
	BYTE        byTODO2;    		// 05 TODO: implement introduced in 1264
	DWORD		dwIDResrc;			// 06 Item resource number
	DWORD		dwIDIcon;			// 07 Item icon resource number
	DWORD		dwSoundID0;			// 08 Sound ID - If 0, no sound
	DWORD		dwSoundID1;			// 09 Sound ID - If 0, no sound

	BYTE	byClass;			// 10 Refer to Item Type b enum e_ItemClass
	BYTE	byIsRobeType;		// 11 Robe type item with a whole top and bottom
	BYTE	byAttachPoint;		// 12 Mounting location
	BYTE	byNeedRace;			// 13 Race
	BYTE	byNeedClass;		// 14 Job

	short	siDamage;			// 15 Weapon attack-strike power
	short	siAttackInterval;	// 16 Attack time 100 is 1 second
